/*
Navicat MySQL Data Transfer

Source Server         : local3306
Source Server Version : 50553
Source Host           : localhost:3306
Source Database       : hcmanage

Target Server Type    : MYSQL
Target Server Version : 50553
File Encoding         : 65001

Date: 2019-10-13 10:20:08
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for cctable
-- ----------------------------
DROP TABLE IF EXISTS `cctable`;
CREATE TABLE `cctable` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `ccid` varchar(1024) NOT NULL COMMENT '车次编号',
  `ccname` varchar(1024) DEFAULT NULL COMMENT '车次名称',
  `start` varchar(1024) DEFAULT NULL COMMENT '始发站',
  `end` varchar(1024) DEFAULT NULL COMMENT '终点站',
  `time` varchar(1024) DEFAULT NULL COMMENT '发车时间',
  `rwpage` varchar(1024) DEFAULT NULL COMMENT '软卧剩余票数',
  `rwpice` varchar(1024) DEFAULT NULL COMMENT '软卧价格',
  `ywpage` varchar(1024) DEFAULT NULL COMMENT '硬卧剩余票数',
  `ywpice` varchar(1024) DEFAULT NULL COMMENT '硬卧价格',
  `yzpage` varchar(1024) DEFAULT NULL COMMENT '硬座剩余票数',
  `yzpice` varchar(1024) DEFAULT NULL COMMENT '硬座价格',
  `wzpage` varchar(1024) DEFAULT NULL COMMENT '站票剩余票数',
  `wzpice` varchar(1024) DEFAULT NULL COMMENT '站票价格',
  `cartype` varchar(1024) DEFAULT NULL,
  `realtime` varchar(1024) DEFAULT NULL,
  `reachtime` varchar(1024) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=262 DEFAULT CHARSET=gbk;

-- ----------------------------
-- Records of cctable
-- ----------------------------
INSERT INTO `cctable` VALUES ('1', 'G702', '大连到北京', '大连', '北京', '2019-6-10 12:00', '0', '400', '100', '125', '100', '100', '100', '100', 'G', '1560139200000', '2019-6-10 16:00');
INSERT INTO `cctable` VALUES ('3', 'G706', '大连到北京西', '大连', '北京西', '2019-6-10 12:00', '94', '400', '0', '150', '100', '100', '100', '100', 'G', '1560139200000', '2019-6-10 16:00');
INSERT INTO `cctable` VALUES ('13', 'G710', '大连到上海', '大连', '上海', '2019-6-10 12:00', '99', '1400', '100', '843', '100', '300', '100', '300', 'G', '1560139200000', '2019-6-10 23:00');
INSERT INTO `cctable` VALUES ('18', 'G45', '大连北到北京西', '大连北', '北京西', '2019-6-10 12:00', '98', '400', '100', '125', '0', '100', '100', '100', 'G', '1560139200000', '2019-6-10 16:00');
INSERT INTO `cctable` VALUES ('15', 'K765', '金州到西安', '金州', '西安', '2019-6-10 12:00', '100', '1565', '100', '900', '100', '500', '100', '400', 'K', '1560139200000', '2019-6-11 16:00');
INSERT INTO `cctable` VALUES ('11', 'G806', '大连到北京', '大连', '北京', '2019-6-10 12:00', '100', '400', '0', '125', '0', '100', '0', '100', 'G', '1560139200000', '2019-6-10 16:00');
INSERT INTO `cctable` VALUES ('9', 'G129', '大连北到北京', '大连北', '北京', '2019-6-10 12:00', '97', '400', '100', '125', '100', '100', '100', '100', 'G', '1560139200000', '2019-6-10 16:00');
INSERT INTO `cctable` VALUES ('16', 'G308', '大连到杭州', '大连', '杭州', '2019-6-11 12:00', '85', '1400', '99', '900', '100', '400', '0', '400', 'G', '1560225600000', '2019-6-11 19:00');
INSERT INTO `cctable` VALUES ('2', 'G7021', '大连到北京', '大连', '北京', '2019-6-11 12:00', '100', '400', '100', '125', '0', '100', '100', '100', 'G', '1560225600000', '2019-6-11 16:00');
INSERT INTO `cctable` VALUES ('10', 'G1291', '大连北到北京', '大连北', '北京', '2019-6-11 12:00', '0', '400', '100', '200', '100', '100', '0', '100', 'G', '1560225600000', '2019-6-11 16:00');
INSERT INTO `cctable` VALUES ('12', 'G8061', '大连到北京', '大连', '北京', '2019-6-11 12:00', '100', '400', '0', '200', '100', '100', '100', '100', 'G', '1560225600000', '2019-6-11 16:00');
INSERT INTO `cctable` VALUES ('5', 'G301', '大连到北京西', '大连', '北京西', '2019-6-10 12:00', '0', '400', '100', '200', '0', '100', '100', '100', 'G', '1560139200000', '2019-6-10 16:00');
INSERT INTO `cctable` VALUES ('4', 'G7061', '大连到北京西', '大连', '北京西', '2019-6-11 12:00', '100', '400', '100', '200', '100', '100', '100', '100', 'G', '1560225600000', '2019-6-11 16:00');
INSERT INTO `cctable` VALUES ('7', 'G789', '大连到北京', '大连', '北京', '2019-6-12 12:00', '0', '400', '100', '200', '100', '100', '0', '100', 'G', '1560312000000', '2019-6-12 16:00');
INSERT INTO `cctable` VALUES ('25', 'T181', '金州到北京', '金州', '北京', '2019-06-10 12:00', '100', '500', '100', '300', '100', '200', '100', '200', 'T', '1560139200000', '2019-6-11 12:00');
INSERT INTO `cctable` VALUES ('8', 'G7891', '大连到北京', '大连', '北京', '2019-6-13 12:00', '100', '400', '100', '200', '100', '100', '100', '100', 'G', '1560398400000', '2019-6-13 16:00');
INSERT INTO `cctable` VALUES ('19', 'G451', '大连北到北京西', '大连北', '北京西', '2019-6-11 12:00', '100', '400', '100', '200', '100', '100', '100', '100', 'G', '1560225600000', '2019-6-11 16:00');
INSERT INTO `cctable` VALUES ('20', 'G46', '大连到北京', '大连', '北京', '2019-6-10 12:00', '98', '400', '100', '200', '100', '100', '1000', '100', 'G', '1560139200000', '2019-6-10 16:00');
INSERT INTO `cctable` VALUES ('6', 'G3011', '大连到北京西', '大连', '北京西', '2019-06-11 12:00', '0', '400', '100', '200', '0', '100', '0', '100', 'G', '1560225600000', '2019-6-11 16:00');
INSERT INTO `cctable` VALUES ('24', 'K201', '大连到北京', '大连', '北京', '2019-06-11 12:00', '0', '200', '99', '200', '0', '100', '0', '100', 'K', '1560225600000', '2019-6-11 20:00');
INSERT INTO `cctable` VALUES ('21', 'G461', '大连到北京', '大连', '北京', '2019-6-11 12:00', '100', '400', '100', '200', '100', '100', '100', '100', 'G', '1560225600000', '2019-6-11 16:00');
INSERT INTO `cctable` VALUES ('23', 'K861', '旅顺到河南', '旅顺', '河南', '2019-06-10 12:00', '100', '500', '100', '400', '110', '200', '100', '200', 'K', '1560139200000', '2019-6-12 6:00');
INSERT INTO `cctable` VALUES ('26', 'T131', '大连到南京', '大连', '南京', '2019-06-10 12:00', '100', '585', '100', '370', '100', '217', '100', '217', 'T', '1560139200000', '2019-06-11 09:00');

-- ----------------------------
-- Table structure for corder
-- ----------------------------
DROP TABLE IF EXISTS `corder`;
CREATE TABLE `corder` (
  `id` varchar(30) NOT NULL,
  `name` varchar(1024) DEFAULT NULL COMMENT '订票人',
  `username` varchar(1024) DEFAULT NULL COMMENT '订票人帐号',
  `phone` varchar(1024) DEFAULT NULL COMMENT '订票人手机号',
  `bodyid` varchar(1024) DEFAULT NULL COMMENT '订票人身份证号',
  `ccid` varchar(1024) DEFAULT NULL COMMENT '预订车次编号',
  `type` varchar(1024) DEFAULT NULL COMMENT '乘坐方式',
  `num` varchar(30) DEFAULT NULL COMMENT '订票张数',
  `seatnum` bigint(20) DEFAULT NULL COMMENT '座位号',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=gbk;

-- ----------------------------
-- Records of corder
-- ----------------------------
INSERT INTO `corder` VALUES ('1559546428210380', '关羽', 'trust', '17614281891', '210213199509255210', 'K201', 'yw', '1', '1');

-- ----------------------------
-- Table structure for ggtable
-- ----------------------------
DROP TABLE IF EXISTS `ggtable`;
CREATE TABLE `ggtable` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `ggid` varchar(1024) DEFAULT NULL COMMENT '公告编号',
  `ggtitle` varchar(1024) DEFAULT NULL COMMENT '公告标题',
  `ggtext` text CHARACTER SET utf8 COMMENT '公告内容',
  `ggtime` varchar(30) DEFAULT NULL COMMENT '公告日期',
  `writer` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=19 DEFAULT CHARSET=gbk;

-- ----------------------------
-- Records of ggtable
-- ----------------------------
INSERT INTO `ggtable` VALUES ('10', '003', '铁道安全管理规定', '　铁路安全管理条例 <hr/> 第一条　为了加强铁路安全管理，保障铁路运输安全和畅通，保护人身安全和财产安全，制定本条例。 <br/>第二条　铁路安全管理坚持安全第一、预防为主、综合治理的方针。 <br/> 第三条　国务院铁路行业监督管理部门负责全国铁路安全监督管理工作，国务院铁路行业监督管理部门设立的铁路监督管理机构负责辖区内的铁路安全监督管理工作。国务院铁路行业监督管理部门和铁路监督管理机构统称铁路监管部门。 国务院有关部门依照法律和国务院规定的职责，负责铁路安全管理的有关工作。 <br/> 第四条　铁路沿线地方各级人民政府和县级以上地方人民政府有关部门应当按照各自职责，加强保障铁路安全的教育，落实护路联防责任制，防范和制止危害铁路安全的行为，协调和处理保障铁路安全的有关事项，做好保障铁路安全的有关工作。 <br/> 第五条　从事铁路建设、运输、设备制造维修的单位应当加强安全管理，建立健全安全生产管理制度，落实企业安全生产主体责任，设置安全管理机构或者配备安全管理人员，执行保障生产安全和产品质量安全的国家标准、行业标准，加强对从业人员的安全教育培训，保证安全生产所必需的资金投入。 铁路建设、运输、设备制造维修单位的工作人员应当严格执行规章制度，实行标准化作业，保证铁路安全。 <br/> 第六条　铁路监管部门、铁路运输企业等单位应当按照国家有关规定制定突发事件应急预案，并组织应急演练。 <br/> 第七条　禁止扰乱铁路建设、运输秩序。禁止损坏或者非法占用铁路设施设备、铁路标志和铁路用地。 任何单位或者个人发现损坏或者非法占用铁路设施设备、铁路标志、铁路用地以及其他影响铁路安全的行为，有权报告铁路运输企业，或者向铁路监管部门、公安机关或者其他有关部门举报。接到报告的铁路运输企业、接到举报的部门应当根据各自职责及时处理。 对维护铁路安全作出突出贡献的单位或者个人，按照国家有关规定给予表彰奖励。  <br/>第八条　铁路建设工程的勘察、设计、施工、监理以及建设物资、设备的采购，应当依法进行招标。  <br/>第九条　从事铁路建设工程勘察、设计、施工、监理活动的单位应当依法取得相应资质，并在其资质等级许可的范围内从事铁路工程建设活动。  <br/>第十条　铁路建设单位应当选择具备相应资质等级的勘察、设计、施工、监理单位进行工程建设，并对建设工程的质量安全进行监督检查，制作检查记录留存备查。  <br/>第十一条　铁路建设工程的勘察、设计、施工、监理应当遵守法律、行政法规关于建设工程质量和安全管理的规定，执行国家标准、行业标准和技术规范。', '2019-03-14', 'admin');
INSERT INTO `ggtable` VALUES ('11', '0502', '关于铁道部学生票价优惠的通知', '2003年初，教育部办公厅、铁道部办公厅联合发出《关于高等学校学生购火车票使用优惠卡的通知》（教学厅［2003］1号，以下简称《通知》），决定对全国普通高等学校（含经批准实施学历教育的民办高等学校，以下统称高等学校）学生往返家庭与学校之间乘坐火车时，实行凭附有火车票学生优惠卡的学生证购票办法。经过上一个寒、暑假的试行，现已具备全部实施的条件。为此决定，自本学期寒假开始，高等学校中符合购买火车票硬座半价条件的学生，一律凭优惠卡购票乘车。现将有关事项通知如下：<hr/>一、各铁路局（含青藏铁路公司，以下同）、分局、站段要严格按照《通知》要求认真落实各项准备工作，继续做好火车票优惠卡读写仪的调试和使用培训，确保学生顺利购票、乘车。  　　<br/>二、各铁路局、分局、站段要严格按照《通知》要求凭卡售票，对没有火车票优惠卡的学生不得发售学生票。  　<br/>三、为了保证学生票购票优惠卡工作顺利推进，在前期无偿配送识别器的基础上，不足部分由各铁路局按优惠价（可读写式850元，只读式300元）购买。  　　配送识别器已有故障的，可将仪器寄回成都四川大学科鸿新技术研究所，由其无偿更换或维修。  　　代售点发售学生票的，必须经铁路局客运主管部门同意后，按有关规定执行。  　　<br/>四、各高等学校要认真做好以下工作：  　　<br/>（一）严格按照《铁路旅客运输规程》对学生票的规定和《通知》要求，做好学生证和火车票优惠卡的管理及使用工作。因没有优惠卡影响学生乘车的，由学校负责。  　　<br/>（二）积极配合铁路部门做好学生票发售工作，教育学生购票和乘车要自觉遵守铁路规章。  　　<br/>（三）尚未为2004年秋季入学的新生购买优惠卡的高校，请尽快与成都四川大学科鸿新技术研究所联系购买。（地址：成都市一环路一段24号75号信箱，邮编：610065， 电话：028－85407992、85407993、 89589678、88848039、89028346，传真：028－85407991）。  　　<br/>（四）优惠卡必须贴于学生证内空白部位，无空白处的贴在插入封皮页的任何一面，封皮遮挡无碍（封皮与内页分开的不能贴于封皮），但一经粘贴就不能揭下重贴。  　　<br/>（五）学生火车票优惠卡中已储存购票数4次，以后学生注册时由学校在优惠卡中按每学年4次增输（仪器如有故障，请与成都四川大学科鸿新技术研究所联系更换）。', '2019-03-18', '阎述伟');
INSERT INTO `ggtable` VALUES ('13', '0050', '铁道部关于加强企业自备货车管理的通知', ' 完成国家运输任务，加强对企业自备篷布的使用管理，加速周转，保证安全，现将有关问题通知如下：  <hr/>一、铁路运输中，以敞车代棚车装运怕湿、易燃货物时，铁路应负责提供篷布。为弥补铁路篷布不足，提倡、鼓励企业在自愿基础上使用自备篷布。  运输毒害品、腐蚀性的货物，应按规定使用企业自备篷布。  <br/>二、企业自备篷布要求具有防水、防火、防霉性能，规格一般为9×5.5米。篷布腰绳、边绳必须是直径1.1～1.3厘米、拉力在300公斤以上的棕绳、麻绳，禁止使用其它代用品。篷布四角和两侧用黄色油漆涂打所属单位名称和编码，两侧编码下方各通栏涂打一条宽150毫米的横杠标记。  <br/> 三、发货人使用自备篷布，应在办理货物托运手续时，在货物运单“发货人记载事项”栏内注明“自备篷布×张”字样，并在“铁路货车篷布号码”栏内划“■”号。   <br/>四、货主装车苫盖自备篷布，应符合《铁路货物装载加固规则》和使用篷布的有关规定。   <br/>五、铁路到站应填写特价运输证明书，连同企业自备篷布一起交给收货人。   <br/>六、收货人对到达的发货人自备篷布应尽快到车站办理托运，在30日内不核收运费。铁路车站要优先受理，及时组织装车，不得积压，最迟不得超过一个承运日期表周期。进行中转作业时，应在当天装出。   <br/>七、铁路到站不办理零担发送业务的，应由收货人将自备篷布送至邻近的零担办理站办理回送。   <br/>八、本通知自一九八六年八月一日起执行。过去有关文件与本通知有抵触的，按本通知执行。  如果想了解相关法规解析和案例可关注佰佰安全网的安全说法频道。让你的生活更安心。 ', '2019-05-19', 'admin');
INSERT INTO `ggtable` VALUES ('14', '0051', '铁道部关于发布《铁路消防管理办法》的通知', '<br/> 第一条　为加强铁路消防工作，保障铁路运输生产和基本建设安全，努力减 少火灾事故造成的财产损失和人员伤亡，根据《中华人民共和国消防法》，制定 本办法。      <br/>第二条　铁路局、工程局、勘测设计院所属各单位均应遵守本办法。国际列 车在我国境内也适用本办法。      <br/>第三条　铁路消防工作贯彻“预防为主，防消结合”的方针，坚持专门机关 与群众路线相结合的原则，实行防火安全责任制。      <br/>第四条　铁路消防工作由铁道部领导，由各铁路局、工程局、勘测设计院负 责。各局、院应将消防工作纳入生产、经营和基本建设之中，使消防工作与铁路 的改革与发展相适应。      <br/>第五条　铁路消防工作由铁路公安机关实施监督管理，由各级铁路公安消防 机构负责实施，其监督管辖范围按公安部有关规定执行。        <br/>第六条　铁路各单位的第一管理者对本单位的消防工作全面负责，分管领导 对分管工作范围内的消防工作负责，消防工作实行逐级负责制和岗位防火负责制。      <br/>第七条　各单位应建立防火委员会或领导小组，在防火责任人领导下，定期 召开会议，组织、协调本单位的消防工作。工程工地消防工作由工程指挥部负责， 也应建立防火委员会或领导小组。', '2019-05-19', 'admin');
INSERT INTO `ggtable` VALUES ('15', '0052', '铁道部通知做好当前全路干部职工思想教育工作', ' 铁道部政治部近日下发 《关于做好当前全路干部职工思想教育工作的通知》，要求全路各级党组织扎实做好当前全路干部职工的思想教育工作，迅速把干部职工的思想和行动统一到中央决定和部党组的部署上来，积极投身以“保安全、保质量、保稳定、促发展”立功竞赛为主题的创先争优活动，推进铁路现代化建设事业健康发展。      通知要求，各级党组织充分发挥政治优势，把统一思想、深化认识、稳定队伍作为当前的一项重点工作来抓。各级党员领导干部要坚决与党中央、部党组保持高度一致，充分发挥表率带头作用，积极主动、全身心投入工作。要激励干部职工进一步发扬优良传统，以良好的精神风貌、出色的工作表现，向全国人民展示铁路职工队伍是一支值得信赖的队伍，是一支特别能战斗的队伍，是一支能够让党、国家和人民放心的队伍。要广泛深入宣传全路运输安全和工程建设电视电话会议精神，强化确保铁路运输安全、确保工程建设质量和施工安全、确保干部职工队伍稳定的宣传教育，组织和动员广大干部职工群策群力、众志成城，夺取 “十二五”开局之年铁路改革发展的新胜利。      通知强调，各级领导干部要针对当前职工普遍关注的热点问题，把中央的决定精神讲透彻，把部党组的各项决策措施讲清楚，做好解疑答惑、凝心聚力工作。要深入开展创先争优活动，切实发挥一线党支部的战斗堡垒作用和广大党员的先锋模范作用，用各项工作的新进展体现创先争优活动的新成效。      部党组近日决定，在全路干部职工中广泛开展以“保安全、保质量、保稳定、促发展”立功竞赛为主题的创先争优活动。通知要求各单位加强对活动的组织领导，通过扎实有效的宣传教育，努力营造创优争先的浓厚氛围，激励广大干部职工充分发挥积极性、主动性和创造性，为推进铁路现代化建设作出新的更大贡献。（记者唐克军）', '2019-05-19', 'admin');
INSERT INTO `ggtable` VALUES ('16', '0056', '铁道部关于公布铁道部规章及规范性文件清理结果的通知', '部属各单位，部内各单位： 　　为了适应我国加入WTO的形势需要，进一步加强铁路法制建设，做到依法行政、依法治路，部按照国务院的要求，依据《中华人民共和国立法法》、国务院《规章制定程序条例》和《铁道部规章制定办法》（部令第6号）的有关规定，对截至2001年底前的现行规章和规范性文件共980件进行了全面清理。清理结果公布如下： 　　<br/>1．继续有效的规章及规范性文件为611件。其中包括需要修改但现时仍为有效的133件。 　　<br/>2．明令废止的规章及规范性文件为263件。 　　<br/>3．宣布失效的规章及规范性文件为106件。', '2019-05-19', 'admin');
INSERT INTO `ggtable` VALUES ('1', '005', '关于2019年6月6日—10日临时加开部分旅客列车的公告', '<br/>1.2019年6月6—10日武昌至襄阳间加开Z6706/7次、Z6708/5次。 \r\n<br/>2.2019年6月7—9日武昌～十堰加开K8086/7、K8088/5次。 \r\n<br/>3.2019年6月7—9日武昌～荆门加开K8106/7、K8108/5次。 \r\n<br/>4.2019年6月6日至2019年6月9日周口-郑州间每日加开K4868次。 \r\n<br/>5.2019年6月6日至2019年6月9日郑州-周口间每日加开K4867次。 \r\n<br/>6. 2019年6月6日-9日武汉～宜昌东加开D9326/7 D9328/5次、汉口～宜昌东加开D9307/8次2对。 \r\n<br/>7. 2019年6月6日-9日武汉～宜昌东加开D9322/3、D9324/1次、汉口～宜昌东加开D9305/6次计2对。 \r\n<br/>8. 2019年6月6日-9日汉口～恩施加开D9303/4次 \r\n<br/>9. 2019年6月6日-9日武汉～荆州加开D9334/5 D9336/3次 \r\n<br/>10. 2019年6月6日武汉（黄冈东）～宜昌东加开D9310/1 D9312/09次、宜昌东～黄冈东加开D9316/3 D9314/5次、黄冈东-武汉加开C5638次计2.5对。 \r\n<br/>11. 2019年6月6日-9日武汉～孝感北加开G6804/3次。 \r\n<br/>12. 2019年6月6,7,9日商丘-武汉间加开G4535次。 \r\n<br/>13. 2019年6月6,7,9日武汉-商丘间加开G4536次。 \r\n<br/>14. 2019年6月7日至2019年6月9日郑州东-西安北间每日加开G2007次。 \r\n<br/>15. 2019年6月7日至2019年6月9日西安北-郑州东间每日加开G2012次。 \r\n<br/>具体详情请登陆WWW.12306.CN网站查询，如有变化请以车站当日公告为准。 \r\n<br/>1.2019年6月6—10日武昌至襄阳间加开Z6706/7次、Z6708/5次。 \r\n<br/>2.2019年6月7—9日武昌～十堰加开K8086/7、K8088/5次。 \r\n<br/>3.2019年6月7—9日武昌～荆门加开K8106/7、K8108/5次。 \r\n<br/>4.2019年6月6日至2019年6月9日周口-郑州间每日加开K4868次。 \r\n<br/>5.2019年6月6日至2019年6月9日郑州-周口间每日加开K4867次。 \r\n<br/>6. 2019年6月6日-9日武汉～宜昌东加开D9326/7 D9328/5次、汉口～宜昌东加开D9307/8次2对。 \r\n<br/>7. 2019年6月6日-9日武汉～宜昌东加开D9322/3、D9324/1次、汉口～宜昌东加开D9305/6次计2对。 \r\n<br/>8. 2019年6月6日-9日汉口～恩施加开D9303/4次 \r\n<br/>9. 2019年6月6日-9日武汉～荆州加开D9334/5 D9336/3次 \r\n<br/>10. 2019年6月6日武汉（黄冈东）～宜昌东加开D9310/1 D9312/09次、宜昌东～黄冈东加开D9316/3 D9314/5次、黄冈东-武汉加开C5638次计2.5对。 \r\n<br/>11. 2019年6月6日-9日武汉～孝感北加开G6804/3次。 \r\n<br/>12. 2019年6月6,7,9日商丘-武汉间加开G4535次。 \r\n<br/>13. 2019年6月6,7,9日武汉-商丘间加开G4536次。 \r\n<br/>14. 2019年6月7日至2019年6月9日郑州东-西安北间每日加开G2007次。 \r\n<br/>15. 2019年6月7日至2019年6月9日西安北-郑州东间每日加开G2012次。 \r\n<br/>具体详情请登陆WWW.12306.CN网站查询，如有变化请以车站当日公告为准。 \r\n<br/>1.2019年6月6—10日武昌至襄阳间加开Z6706/7次、Z6708/5次。 \r\n<br/>2.2019年6月7—9日武昌～十堰加开K8086/7、K8088/5次。 \r\n<br/>3.2019年6月7—9日武昌～荆门加开K8106/7、K8108/5次。 \r\n<br/>4.2019年6月6日至2019年6月9日周口-郑州间每日加开K4868次。 \r\n<br/>5.2019年6月6日至2019年6月9日郑州-周口间每日加开K4867次。 \r\n<br/>6. 2019年6月6日-9日武汉～宜昌东加开D9326/7 D9328/5次、汉口～宜昌东加开D9307/8次2对。 \r\n<br/>7. 2019年6月6日-9日武汉～宜昌东加开D9322/3、D9324/1次、汉口～宜昌东加开D9305/6次计2对。 \r\n<br/>8. 2019年6月6日-9日汉口～恩施加开D9303/4次 \r\n<br/>9. 2019年6月6日-9日武汉～荆州加开D9334/5 D9336/3次 \r\n<br/>10. 2019年6月6日武汉（黄冈东）～宜昌东加开D9310/1 D9312/09次、宜昌东～黄冈东加开D9316/3 D9314/5次、黄冈东-武汉加开C5638次计2.5对。 \r\n<br/>11. 2019年6月6日-9日武汉～孝感北加开G6804/3次。 \r\n<br/>12. 2019年6月6,7,9日商丘-武汉间加开G4535次。 \r\n<br/>13. 2019年6月6,7,9日武汉-商丘间加开G4536次。 \r\n<br/>14. 2019年6月7日至2019年6月9日郑州东-西安北间每日加开G2007次。 \r\n<br/>15. 2019年6月7日至2019年6月9日西安北-郑州东间每日加开G2012次。 \r\n<br/>具体详情请登陆WWW.12306.CN网站查询，如有变化请以车站当日公告为准。 \r\n<br/>1.2019年6月6—10日武昌至襄阳间加开Z6706/7次、Z6708/5次。 \r\n<br/>2.2019年6月7—9日武昌～十堰加开K8086/7、K8088/5次。 \r\n<br/>3.2019年6月7—9日武昌～荆门加开K8106/7、K8108/5次。 \r\n<br/>4.2019年6月6日至2019年6月9日周口-郑州间每日加开K4868次。 \r\n<br/>5.2019年6月6日至2019年6月9日郑州-周口间每日加开K4867次。 \r\n<br/>6. 2019年6月6日-9日武汉～宜昌东加开D9326/7 D9328/5次、汉口～宜昌东加开D9307/8次2对。 \r\n<br/>7. 2019年6月6日-9日武汉～宜昌东加开D9322/3、D9324/1次、汉口～宜昌东加开D9305/6次计2对。 \r\n<br/>8. 2019年6月6日-9日汉口～恩施加开D9303/4次 \r\n<br/>9. 2019年6月6日-9日武汉～荆州加开D9334/5 D9336/3次 \r\n<br/>10. 2019年6月6日武汉（黄冈东）～宜昌东加开D9310/1 D9312/09次、宜昌东～黄冈东加开D9316/3 D9314/5次、黄冈东-武汉加开C5638次计2.5对。 \r\n<br/>11. 2019年6月6日-9日武汉～孝感北加开G6804/3次。 \r\n<br/>12. 2019年6月6,7,9日商丘-武汉间加开G4535次。 \r\n<br/>13. 2019年6月6,7,9日武汉-商丘间加开G4536次。 \r\n<br/>14. 2019年6月7日至2019年6月9日郑州东-西安北间每日加开G2007次。 \r\n<br/>15. 2019年6月7日至2019年6月9日西安北-郑州东间每日加开G2012次。 \r\n<br/>具体详情请登陆WWW.12306.CN网站查询，如有变化请以车站当日公告为准。 \r\n<br/>1.2019年6月6—10日武昌至襄阳间加开Z6706/7次、Z6708/5次。 \r\n<br/>2.2019年6月7—9日武昌～十堰加开K8086/7、K8088/5次。 \r\n<br/>3.2019年6月7—9日武昌～荆门加开K8106/7、K8108/5次。 \r\n<br/>4.2019年6月6日至2019年6月9日周口-郑州间每日加开K4868次。 \r\n<br/>5.2019年6月6日至2019年6月9日郑州-周口间每日加开K4867次。 \r\n<br/>6. 2019年6月6日-9日武汉～宜昌东加开D9326/7 D9328/5次、汉口～宜昌东加开D9307/8次2对。 \r\n<br/>7. 2019年6月6日-9日武汉～宜昌东加开D9322/3、D9324/1次、汉口～宜昌东加开D9305/6次计2对。 \r\n<br/>8. 2019年6月6日-9日汉口～恩施加开D9303/4次 \r\n<br/>9. 2019年6月6日-9日武汉～荆州加开D9334/5 D9336/3次 \r\n<br/>10. 2019年6月6日武汉（黄冈东）～宜昌东加开D9310/1 D9312/09次、宜昌东～黄冈东加开D9316/3 D9314/5次、黄冈东-武汉加开C5638次计2.5对。 \r\n<br/>11. 2019年6月6日-9日武汉～孝感北加开G6804/3次。 \r\n<br/>12. 2019年6月6,7,9日商丘-武汉间加开G4535次。 \r\n<br/>13. 2019年6月6,7,9日武汉-商丘间加开G4536次。 \r\n<br/>14. 2019年6月7日至2019年6月9日郑州东-西安北间每日加开G2007次。 \r\n<br/>15. 2019年6月7日至2019年6月9日西安北-郑州东间每日加开G2012次。 \r\n<br/>具体详情请登陆WWW.12306.CN网站查询，如有变化请以车站当日公告为准。 \r\n', '2019-05-31', 'admin');
INSERT INTO `ggtable` VALUES ('2', '006', '“周末游龙江”高铁一日游', '　为深入贯彻习总书记在东北三省考察时提出的“绿水青山、冰天雪地都是金山银山”指示精神。在省文化和旅游厅策划指导下，中国铁路哈尔滨局集团公司的大力支持下，哈铁国旅集团设计开发了以加强省内旅游，以旅游促进经济发展为目的的“周末游龙江·高铁一日游”系列产品。该产品充分发挥铁路交通运输优势，深度开发省内特色旅游产品，深度搅动龙江旅游市场，每周六发团，方便市民，切实满足大众旅游消费需求。 \r\n　　<br/>主要产品如下： \r\n　　<hr/>1、精彩在鹤乡：与丹顶鹤亲密接触，参观北纬 47度世界黄金奶源地，品尝美味正宗齐齐哈尔烤肉围桌餐，康养体验AAAA齐齐哈尔水师森林温泉度假区。 \r\n　　<br/>去程：D6901次哈尔滨5:37开、齐齐哈尔南7:04到 \r\n　　<br/>回程：D6918次齐齐哈尔17:16开、哈尔滨19:00到 \r\n　　  \r\n　　<br/>2、相约阿木塔：草原1日畅游，游国家AAAA旅游景区阿木塔蒙古风情园，品尝含美味正宗蒙古特色手把肉。 \r\n　　<br/>去程：D6905次哈尔滨6:55开、杜尔伯特8:11到 \r\n　　<br/>回程：D6918次齐齐哈尔17:50开、哈尔滨19:00到 \r\n　　  \r\n　　<br/>3、豪情碾子山：游东北亚最美旅游小镇国家旅游AAAA景区——碾子山，品尝美味正宗地锅炖，赠送食泉酒美礼品装1瓶，军事文化主题公园亲自观看实弹射击。 \r\n　　<br/>去程：D6901次哈尔滨5:37开，齐齐哈尔南7:04到 \r\n　　<br/>回程：D6918次齐齐哈尔17:16开，哈尔滨19:00到 \r\n　　  \r\n　　<br/>4、多彩在大庆：工业游、温泉之旅、研学之旅。 \r\n　　<br/>去程：D7903次哈尔滨8:30开、大庆西9:30到 \r\n　　<br/>回程：D7918次大庆西18:48开、哈尔滨20:00到 \r\n　　  \r\n　　<br/>5、青山绿水仙境游：国家级森林、野生动物自然保护区和国家4A级旅游景区——罗勒密山景区1日畅游。 \r\n　　<br/>去程：D7809次哈尔滨07:34开高楞09:10到 \r\n　　<br/>回程：D7824次高愣18:52开哈尔滨20:25到 \r\n　　  \r\n　　<br/>6、生态小九寨：威虎山国家森林公园核心景区，水帘洞、情侣峰、仙人洞、九天瀑布、醉仙桥、碧海、万寿松、人参泉、龙潭瀑布等让人流连忘返。 \r\n　　<br/>去程：D8501次哈尔滨05:25开、牡丹江06:56到 \r\n　　<br/>回程：D8528次牡丹江20:53开、哈尔滨22:33到 \r\n　　  \r\n　　<br/>哈铁国旅咨询电话：0451-53616718  53616999 \r\n', '2019-05-31', 'admin');
INSERT INTO `ggtable` VALUES ('3', '007', '关于2019年6月5日-2019年6月10日增开部分旅客列车的公告', '<br/>1.2019年6月5、8日增开上海虹桥-安庆G9250/1次。\r\n　　<br/>2.2019年6月6日增开上海-南京D9570次，南京-上海D9569次，上海虹桥-宁波G9529次。\r\n　　<br/>3.2019年6月6、9日增开上海虹桥-金寨G9402/3次，金寨-杭州东G9404/1次，杭州东-上海虹桥G9304次，合肥南-黄山北G9507次，黄山北-合肥南G9508次，合肥南-黄山北G9509次，黄山北-合肥南G9510次，上海-无锡D9494次，无锡-上海D9493次，上海-苏州D9492次，苏州-上海D9491次，上海虹桥-杭州东G9301次，南京南-杭州东G9481次，杭州东-南京南G9482次，杭州东-台州G9519次，台州-杭州东G9520次，杭州东-衢州G9395次，衢州-杭州东G9396次。\r\n　　<br/>4.2019年6月6-7、9日增开上海-芜湖G9254/5次，芜湖-上海G9256/3次，上海-安庆G9246/7次，安庆-上海G9248/5次，杭州东-南京南D9486次，南京南-杭州东D9485次，南京南-温州南G7667次，温州南-南京南G7668次，安庆-合肥南G9384次，合肥南-安庆G9383次，安庆-合肥南G9386次，合肥南-安庆G9385次，安庆-合肥南G9388次，合肥南-安庆G9387次。\r\n　　<br/>5.2019年6月6-9日增开上海虹桥-池州G9236/7次，池州-上海虹桥G9238/5次。\r\n　　<br/>6.2019年6月7日增开上海-苏州D9560次，苏州-上海D9561次，上海-无锡D9562次，无锡-上海D9563次，上海-常州D9564次，常州-上海D9565次，上海虹桥-无锡东G9450次，无锡东-上海虹桥G9449次。\r\n　　<br/>7.2019年6月7、9日增开上海-六安G9430/1次，六安-上海G9432/29次，上海虹桥-铜陵G9232/3次，铜陵-上海虹桥G9234/1次，杭州东-合肥南D9482/3次，合肥南-杭州东D9484/1次，上海-六安D9502/3次，六安-上海D9504/1次，上海-徐州D9576次，徐州-上海D9575次。\r\n　　<br/>8.2019年6月8、10日增开安庆-上海虹桥G9252/49次。\r\n　　<br/>9.2019年6月9日增开杭州东-上海虹桥G9302次。\r\n　　<br/>详情请以车站公告为准，若有疑问请致电铁路客服热线021-12306咨询。\r\n　　<br/>欢迎关注“上海铁路12306”微信公众号或下载使用“上铁12306”移动客户端，一路相伴，值得信赖。\r\n', '2019-05-31', 'admin');
INSERT INTO `ggtable` VALUES ('4', '008', '中国铁路哈尔滨局集团有限公司关于临时加开旅客列车等事项的公告', '　　<br/>  一、加开列车 \r\n　　<hr/>1.哈尔滨西～佳木斯D9125/D9126次 \r\n　　<br/>开行日期：D9125次由哈尔滨西、D9126次由佳木斯6月1-2、6-9、15-16、22-23、29-30日开行。     \r\n　　<br/>2.哈尔滨（哈尔滨西）～佳木斯D9127/D9128次  \r\n　　<br/>开行日期： D9127次由哈尔滨、D9128次由佳木斯6月6-9、14-16、21-23、28-30日开行。 \r\n　　<br/>3.哈尔滨西（哈尔滨）～佳木斯D9129/D9130次、哈尔滨西～齐齐哈尔D9151/D9152次继续开行  \r\n　　<br/>开行日期： D9129次由哈尔滨西6月1-29日，D9130次佳木斯6月2-30日开行。D9151次由哈尔滨西、D9152次由齐齐哈尔6月2、7、9、14、16、21、23、28、30日开行。 \r\n　　<br/>4.哈尔滨西（哈尔滨）～齐齐哈尔D9133/4次、哈尔滨～齐齐哈尔南D9135/6次、哈尔滨～大庆西D9137/8次  \r\n　　<br/>开行日期：D9133次由哈尔滨西、D9134次由齐齐哈尔、D9135次由哈尔滨、D9136次由齐齐哈尔南、D9137次由哈尔滨、D9138次由大庆西6月6-9、14-16、21-23、28-30日继续开行。 \r\n　　<br/>5.哈尔滨西（哈尔滨）～牡丹江D9155/ D9156次、哈尔滨（哈尔滨西）～牡丹江D9157/ D9158次  \r\n　　<br/>开行日期： D9155次由哈尔滨西、D9156次由牡丹江、D9157次由哈尔滨、D9158次由牡丹江6月2、14、16日开行。 \r\n　　<br/>6.哈尔滨西～牡丹江D9159/ D9160次  \r\n　　<br/>开行日期： D9159次由哈尔滨西、D9160次由牡丹江6月6、9开行。 \r\n　　<br/>7.加格达奇-大杨树K5116次、大杨树-阿里河K5117次、阿里河-加格达奇K5118次  \r\n　　<br/>开行时间：K5116次由加格达奇、K5117次由大杨树、K5118次由阿里河6月5日开行。 \r\n　　<br/>8.加格达奇-阿里河K5121次、阿里河-大杨树K5122次、大杨树-加格达奇K5123次  \r\n　　<br/>开行时间：K5121次由加格达奇、K5122次由阿里河、K5123次由大杨树6月8日开行。 \r\n　　<br/>9.齐齐哈尔～扎兰屯K5149/50次  \r\n　　<br/>开行日期：K5149次由齐齐哈尔、K5150次由扎兰屯6月6-9日开行。 \r\n　　<br/>二、恢复开行 \r\n　　<hr/>牡丹江～七台河K7051/2次   \r\n　　<br/>恢复开行日期：K7051次由牡丹江、K7052次由七台河6月6-9日开行。  \r\n', '2019-05-31', 'admin');

-- ----------------------------
-- Table structure for glztable
-- ----------------------------
DROP TABLE IF EXISTS `glztable`;
CREATE TABLE `glztable` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `ccid` varchar(30) DEFAULT NULL COMMENT '车次id',
  `glzname` varchar(1024) DEFAULT NULL COMMENT '路过站点',
  `glztime` varchar(1024) DEFAULT NULL COMMENT '路过站点时间',
  `glzrealtime` varchar(1024) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=93 DEFAULT CHARSET=gbk;

-- ----------------------------
-- Records of glztable
-- ----------------------------
INSERT INTO `glztable` VALUES ('7', '16', '北京', '2019-6-11 15:00', '1560236400000');
INSERT INTO `glztable` VALUES ('79', '25', '葫芦岛', '2019-06-10 23:00', '1560178800000');
INSERT INTO `glztable` VALUES ('78', '25', '大连', '2019-06-10 18:00', '1560160800000');
INSERT INTO `glztable` VALUES ('5', '15', '大连', '2019-6-10 15:00', '1560150000000');
INSERT INTO `glztable` VALUES ('6', '15', '北京', '2019-6-11 6:00', '1560204000000');
INSERT INTO `glztable` VALUES ('8', '16', '南京', '2019-6-11 17:00', '1560243600000');
INSERT INTO `glztable` VALUES ('77', '23', '北京', '2019-06-11 12:00', '1560225600000');
INSERT INTO `glztable` VALUES ('82', '25', '廊坊', '2019-06-11 09:00', '1560214800000');
INSERT INTO `glztable` VALUES ('80', '25', '秦皇岛', '2019-06-11 03:00', '1560193200000');
INSERT INTO `glztable` VALUES ('9', '13', '北京', '2019-06-10 18:00', '1560160800000');
INSERT INTO `glztable` VALUES ('81', '25', '唐山', '2019-06-11 06:00', '1560204000000');
INSERT INTO `glztable` VALUES ('75', '23', '大连', '2019-06-10 15:00', '1560150000000');
INSERT INTO `glztable` VALUES ('76', '23', '秦皇岛', '2019-06-11 6:00', '1560204000000');
INSERT INTO `glztable` VALUES ('85', '26', '普兰店', '2019-06-10 13:00', '1560142800000');
INSERT INTO `glztable` VALUES ('86', '26', '瓦房店', '2019-06-10 14:00', '1560146400000');
INSERT INTO `glztable` VALUES ('87', '26', '盘锦', '2019-06-10 15:00', '1560150000000');
INSERT INTO `glztable` VALUES ('88', '26', '葫芦岛', '2019-06-10 16:00', '1560153600000');
INSERT INTO `glztable` VALUES ('89', '26', '唐山', '2019-06-10 18:00', '1560160800000');
INSERT INTO `glztable` VALUES ('90', '26', '北京', '2019-06-10 20:00', '1560168000000');
INSERT INTO `glztable` VALUES ('91', '26', '天津', '2019-06-11 03:00', '1560193200000');
INSERT INTO `glztable` VALUES ('92', '26', '济南', '2019-06-11 06:00', '1560204000000');

-- ----------------------------
-- Table structure for help
-- ----------------------------
DROP TABLE IF EXISTS `help`;
CREATE TABLE `help` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `key` varchar(100) DEFAULT NULL,
  `value` varchar(4096) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=11 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of help
-- ----------------------------
INSERT INTO `help` VALUES ('1', '修改', '我们为了避免用户昵称重复带来的问题，不再提供用户昵称修改的功能，同时在用户注册的时候会在后台进行校验。所以，用户名被定义以后无法修改，请谨慎操作！');
INSERT INTO `help` VALUES ('2', '学生打折', '对于学生来说，任何消费的票价都会打半折，同样的，在改签时也会享受同样优惠');
INSERT INTO `help` VALUES ('3', '改签', '很遗憾您没有买到适合您的车票，所以我们决定在火车发车前您可以自由的改签到您想乘坐的车次，当然，我们会赔偿您的票价损失，同时您也有义务补全票价的差值，感谢您的配合！');
INSERT INTO `help` VALUES ('4', '退票退钱', '可能由于您的一时大意，亦或者是您的行程有变，我们允许您的退票请求，但是大量的退票请求会严重增加我们的工作负担，也为更多人的出行带来了不变，所以我们会收取一定的费用作为您的补偿，希望您能谅解！');
INSERT INTO `help` VALUES ('5', '购票买票', '我们提供了功能强大的查询算法，不仅能够找到所有满足条件的车次线路，同时也涵盖途径车站的信息。您可以自由选择适合您出行的车次，不同车次的价格可能相差较大，请您慎重考虑。我们力争于不断优化系统，让您拥有更佳的出行体验');
INSERT INTO `help` VALUES ('6', '查询模糊', '我们提供了功能强大的查询算法，不仅能够找到所有满足条件的车次线路，同时也涵盖途径车站的信息。您可以自由选择适合您出行的车次，不同车次的价格可能相差较大，请您慎重考虑。我们力争于不断优化系统，让您拥有更佳的出行体验');
INSERT INTO `help` VALUES ('7', '服务项目', '火车票订购系统致力于科技改变生活，截止到现在，我们已经提供了较为稳定的订票系统，您的一切信息我们将严格保密，切实保护您的隐私，同时，如果有特别重大的系统问题，请您务必联系我们，我们将赔偿您的一切损失，并对您提供奖励一定的奖金。和谐的环境依靠大家共同创建，如果我们发现有不法分子的违法行为，我们将冻结他的一切账号。维护广大用户的利益');
INSERT INTO `help` VALUES ('8', '审核', '管理员在后台会审核注册的用户身份，如果您的身份审核出现问题请及时与管理员进行联系，感谢您的支持！');

-- ----------------------------
-- Table structure for rideuser
-- ----------------------------
DROP TABLE IF EXISTS `rideuser`;
CREATE TABLE `rideuser` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `username` varchar(255) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `phone` varchar(255) DEFAULT NULL,
  `bodyid` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=26 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of rideuser
-- ----------------------------
INSERT INTO `rideuser` VALUES ('25', 'trust', '关羽', '17614281891', '210213199509255210');

-- ----------------------------
-- Table structure for selecthis
-- ----------------------------
DROP TABLE IF EXISTS `selecthis`;
CREATE TABLE `selecthis` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `selvalue` varchar(255) DEFAULT NULL,
  `selsum` varchar(255) DEFAULT NULL,
  `username` varchar(255) DEFAULT NULL,
  `ccid` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=31 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of selecthis
-- ----------------------------
INSERT INTO `selecthis` VALUES ('30', '24', '1', 'trust', 'K201');

-- ----------------------------
-- Table structure for user
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '增自id',
  `username` varchar(50) DEFAULT NULL COMMENT '登录名',
  `password` varchar(50) DEFAULT NULL COMMENT '登录密码',
  `name` varchar(50) DEFAULT NULL COMMENT '姓名',
  `sex` varchar(20) DEFAULT NULL COMMENT '性别',
  `deptname` varchar(100) DEFAULT NULL COMMENT '所在部门',
  `rolename` varchar(100) DEFAULT NULL COMMENT '角色名称',
  `address` varchar(200) DEFAULT NULL COMMENT '所在地址',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=15 DEFAULT CHARSET=gbk;

-- ----------------------------
-- Records of user
-- ----------------------------
INSERT INTO `user` VALUES ('5', 'admin', '950925', '测试管理员1', '男', '开发部', '系统管理员', '西安科技大学');
INSERT INTO `user` VALUES ('13', 'user', '950925', '测试管理员2', '男', '业务部', '普通管理员', '大连市沙河口区');
INSERT INTO `user` VALUES ('11', '阎述伟', '950925', '阎述伟', '男', '管理部', '普通管理员', '大连市');

-- ----------------------------
-- Table structure for userhis
-- ----------------------------
DROP TABLE IF EXISTS `userhis`;
CREATE TABLE `userhis` (
  `id` int(50) NOT NULL AUTO_INCREMENT,
  `user` varchar(100) DEFAULT NULL,
  `type` varchar(100) DEFAULT NULL,
  `value` varchar(100) DEFAULT NULL,
  `date` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=193 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of userhis
-- ----------------------------
INSERT INTO `userhis` VALUES ('185', 'admin', '增加车次', '金州到北京', 'Sat Jun 01 08:45:31 CST 2019');
INSERT INTO `userhis` VALUES ('187', 'admin', '删除车次', '11', 'Sat Jun 01 16:58:56 CST 2019');
INSERT INTO `userhis` VALUES ('188', 'admin', '权限操作', '启用测试用户', 'Sat Jun 01 20:23:48 CST 2019');
INSERT INTO `userhis` VALUES ('189', 'admin', '权限操作', '禁用trust', 'Sat Jun 01 20:28:15 CST 2019');
INSERT INTO `userhis` VALUES ('192', 'admin', '增加车次', '大连到南京', 'Sun Jun 02 19:54:01 CST 2019');

-- ----------------------------
-- Table structure for webuser
-- ----------------------------
DROP TABLE IF EXISTS `webuser`;
CREATE TABLE `webuser` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `username` varchar(1024) DEFAULT NULL COMMENT '会员帐号',
  `password` varchar(1024) DEFAULT NULL COMMENT '会员登录密码',
  `phone` varchar(30) DEFAULT NULL COMMENT '会员手机号',
  `bodyid` varchar(1024) DEFAULT NULL COMMENT '会员身份证号',
  `name` varchar(1024) DEFAULT NULL COMMENT '会员姓名',
  `isnot` varchar(11) DEFAULT '0' COMMENT '禁用会员标识0启用1禁用',
  `date` varchar(30) DEFAULT NULL COMMENT '会员注册时间',
  `isStudent` varchar(11) DEFAULT NULL,
  `address` varchar(50) DEFAULT NULL,
  `sex` varchar(20) DEFAULT NULL,
  `email` varchar(50) DEFAULT NULL,
  `money` varchar(1024) DEFAULT NULL,
  `isAudit` varchar(50) DEFAULT NULL,
  `studentNum` varchar(1024) DEFAULT NULL,
  `image` varchar(1024) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=72 DEFAULT CHARSET=gbk;

-- ----------------------------
-- Records of webuser
-- ----------------------------
INSERT INTO `webuser` VALUES ('17', 'trust', '950925', '17614281891', '210213199509255210', '关羽', '0', '2019-05-08', '1', '河北唐山市', '男', '1693083039@qq.com', '1350', '0', '13425017', null);
INSERT INTO `webuser` VALUES ('18', 'trustme', '950925', '17614281891', '210213199509255211', '张飞', '0', '2019-05-08', '0', '湖南张家界', '男', '1693083039@qq.com', '0', '0', '', null);
INSERT INTO `webuser` VALUES ('19', 'fire', '950925', '17614281891', '210213199509255212', '马超', '0', '2019-05-08', '1', '辽宁沈阳新民', '男', '1693083039@qq.com', '10000', '0', '13424004', null);
INSERT INTO `webuser` VALUES ('9', '南生与她', '950925', '17614281891', '210213199509255213', '黄忠', '0', '2019-03-03', '1', '辽宁省大连市金州区', '男', '1693083039@qq.com', '10000840', '0', '13424005', null);
INSERT INTO `webuser` VALUES ('10', '池鱼', '950925', '17614281891', '210213199509255214', '夏侯渊', '0', '2019-03-14', '1', '广州肇庆', '女', '1693083039@qq.com', '120000', '0', '13424003', null);
INSERT INTO `webuser` VALUES ('11', '勇男', '950925', '17614281891', '210213199509255215', '诸葛亮', '0', '2019-03-17', '0', '黑龙江七台河shi', '男', '1693083039@qq.com', '9980', '0', '', null);
INSERT INTO `webuser` VALUES ('14', '琪琪', '950925', '17614281891', '210213199509255216', '典韦', '0', '2019-04-25', '0', '云南丽江', '女', '1693083039@qq.com', '0', '0', '', null);
INSERT INTO `webuser` VALUES ('15', '咚咚咚', '950925', '17614281891', '210213199509255217', '司马懿', '0', '2019-05-08', '0', '陕西西安', '男', '1693083039@qq.com', '0', '0', '', null);
INSERT INTO `webuser` VALUES ('45', '白展堂', '950925', '17614281891', '210213199509255218', '魏延', '0', '2019-05-19', '1', '大连市沙河口区', '男', '1693083039@qq.com', '0', '0', '13424002', '');
INSERT INTO `webuser` VALUES ('64', '山水如画', '950925', '17614281891', '210213199509255219', '沙溢', '0', '2019-05-27', '1', '大连市', '男', '1693083039@qq.com', '0', '0', '13424001', '');

-- ----------------------------
-- Table structure for webuserhis
-- ----------------------------
DROP TABLE IF EXISTS `webuserhis`;
CREATE TABLE `webuserhis` (
  `id` int(100) NOT NULL AUTO_INCREMENT,
  `user` varchar(100) CHARACTER SET utf8 DEFAULT NULL,
  `ccid` varchar(1024) CHARACTER SET utf8 DEFAULT NULL,
  `money` varchar(1024) CHARACTER SET utf8 DEFAULT NULL,
  `edittype` varchar(50) DEFAULT NULL,
  `datetime` varchar(1024) DEFAULT NULL,
  `remain` varchar(1024) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=240 DEFAULT CHARSET=gbk;

-- ----------------------------
-- Records of webuserhis
-- ----------------------------
INSERT INTO `webuserhis` VALUES ('239', 'trust', 'K201', '-100', '1', 'Mon Jun 03 15:20:28 CST 2019', '1350');
